[Killed] Equality mutation
StrykerDemo/StrykerDemo/ArrayTools/ArraySearch.cs:7:29
     {
         public static int FindIndex(int[] array, int element)
         {
-            for (int i = 0; i < array.Length; i++)
+            for (int i = 0; i <= array.Length; i++)
             {
                 if (array[i] == element)
killedBy: ArrayToolsTest.ArraySearchTests.ArrayHasOnlyOneNonMatchingElement; ArrayToolsTest.ArraySearchTests.ElementNotFoundReturnsMinusOne; ArrayToolsTest.ArraySearchTests.EmptyArrayReturnsMinusOne

[Killed] Equality mutation
StrykerDemo/StrykerDemo/ArrayTools/ArraySearch.cs:7:29
     {
         public static int FindIndex(int[] array, int element)
         {
-            for (int i = 0; i < array.Length; i++)
+            for (int i = 0; i > array.Length; i++)
             {
                 if (array[i] == element)
killedBy: ArrayToolsTest.ArraySearchTests.ArrayHasOnlyOneMatchingElement; ArrayToolsTest.ArraySearchTests.CheckArrayFindElement; ArrayToolsTest.ArraySearchTests.DuplicateValuesReturnsFirstIndex

[Killed] Equality mutation
StrykerDemo/StrykerDemo/ArrayTools/ArraySearch.cs:9:21
         {
             for (int i = 0; i < array.Length; i++)
             {
-                if (array[i] == element)
+                if (array[i] != element)
                 {
                     return i;
killedBy: ArrayToolsTest.ArraySearchTests.ArrayHasOnlyOneMatchingElement; ArrayToolsTest.ArraySearchTests.ArrayHasOnlyOneNonMatchingElement; ArrayToolsTest.ArraySearchTests.CheckArrayFindElement

[Killed] Block removal mutation
StrykerDemo/StrykerDemo/ArrayTools/ArraySearch.cs:10:17
             for (int i = 0; i < array.Length; i++)
             {
                 if (array[i] == element)
-                {
-                    return i;
-                }
+                {}
             }
             return -1;
killedBy: ArrayToolsTest.ArraySearchTests.ArrayHasOnlyOneMatchingElement; ArrayToolsTest.ArraySearchTests.CheckArrayFindElement; ArrayToolsTest.ArraySearchTests.DuplicateValuesReturnsFirstIndex

[Killed] UnaryMinusExpression to UnaryPlusExpression mutation
StrykerDemo/StrykerDemo/ArrayTools/ArraySearch.cs:14:20
                     return i;
                 }
             }
-            return -1;
+            return +1;
         }
     }
killedBy: ArrayToolsTest.ArraySearchTests.ArrayHasOnlyOneNonMatchingElement; ArrayToolsTest.ArraySearchTests.ElementNotFoundReturnsMinusOne; ArrayToolsTest.ArraySearchTests.EmptyArrayReturnsMinusOne
